Repository: cc-nogueira/weather
Catalog: packages/_presentation_layer/lib/src/l10n/intl_*.arb
Languages: pt

# add_city_page_title
source: City
pt: Localidade

# add_label
source: Add
pt: Adicionar

# add_temp_to_rain_snow_charts_label
source: Add Temp to Rain/Snow charts
pt: Adicionar Temp ao gráfico de Chuva/Neve

# city_label
source: City
pt: Localidade

# country_label
source: Country
pt: País

# dark_light_theme_label
source: Dark/Light theme
pt: Tema Claro/Escuro

# days_label
source: {count, plural, zero{days} one{day} other{{count} days}}
pt: {count, plural, zero{dias} one{dia} other{{count} dias}}

# error_page_title
source: Error
pt: Erro

# error_searching_message
source: Error searching...
pt: Erro pesquisando...

# hours_label
source: {count, plural, zero{hours} one{hour} other{{count} hours}}
pt: {count, plural, zero{horas} one{hora} other{{count} horas}}

# intensity_fem
source: {intensity, select, light{light} moderate{moderate} strong{strong} storm{storm} other{}}
pt: {intensity, select, light{leve} moderate{moderada} strong{forte} storm{tempestade} other{}}

# intensity_masc
source: {intensity, select, light{light} moderate{moderate} strong{strong} storm{storm} other{}}
pt: {intensity, select, light{leve} moderate{moderado} strong{forte} storm{tempestade} other{}}

# label_language_selector
source: Language
pt: Idioma

# label_remove
source: Remove
pt: Excluir

# message_loading
source: Loading...
pt: Carregando...

# message_no_weather_info
source: No weather information
pt: Nenhuma informação de clima encontrada

# no_matches_found_message
source: No matches found
pt: Nenhum resultado encontrado

# no_rain_next_days
source: {count, plural, zero{No rain} one{No rain expected for the next 24 hours} other{No rain expected for the next {count} days}}
pt: {count, plural, zero{Sem chuva} one{Sem chuva esperada para as próximas 24 horas} other{Se chuva esperada para os próximos {count} dias}}

# no_rain_next_hours
source: {count, plural, zero{No rain} one{No rain expected in the next hour} other{No rain expected in the next {count} hours}}
pt: {count, plural, zero{Sem chuva} one{Sem chuva para a próxima hora} other{Sem chuva para as próximas {count} horas}}

# no_rain_or_snow_next_days
source: {count, plural, zero{No rain or snow} one{No rain or snow expected for the next 24 hours} other{No rain or snow expected for the next {count} days}}
pt: {count, plural, zero{Sem chuva ou neve} one{Sem chuva ou neve para as próximas 24 horas} other{Sem chuva ou neve para os próximos {count} dias}}

# no_rain_or_snow_next_hours
source: {count, plural, zero{No rain or snow} one{No rain or snow expected for the next hour} other{No rain or snow expected for the next {count} hours}}
pt: {count, plural, zero{Sem chuva ou neve} one{Sem chuva ou neve para a próxima hora} other{Sem chuva ou neve para as próximas {count} horas}}

# no_snow_next_days
source: {count, plural, zero{No snow} one{No snow expected for the next 24 hours} other{No snow expected for the next {count} days}}
pt: {count, plural, zero{Se neve} one{Sem neve esperada para as próximas 24 horas} other{Se neve esperada para os próximos {count} dias}}

# no_snow_next_hours
source: {count, plural, zero{No snow} one{No snow expected for the next hour} other{No snow expected for the next {count} hours}}
pt: {count, plural, zero{Sem neve} one{Sem neve para a próxima hora} other{Sem neve para as próximas {count} horas}}

# precipitation_chart_title
source: Precipitation
pt: Precipitação

# precipitation_unit_label
source: Precipitation unit
pt: Unidade para chuva e neve

# rain_chart_title
source: Rain
pt: Chuva

# required_label
source: required
pt: obrigatório

# scale_chart_header_message
source: {chartName} scale is defined with four intensity categories:
pt: A Escala de {chartName} é definida com quatro categorias:

# scale_chart_header_sample_message
source: Below sample values painted to scale color.
pt: Abaixo valores reproduzidos dentro da escala de cores.

# scale_chart_title
source: {chartName} scale
pt: Escala de {chartName}

# search_label
source: Search
pt: Pesquisar

# snow_chart_title
source: Snow
pt: Neve

# temp_chart_title
source: Temperature
pt: Temperatura

# temp_unit_label
source: Temperature unit
pt: Unidade para temperatura

# weather_list_sort_by_name_option
source: by Name
pt: por Temp

# weather_list_sort_by_temp_option
source: by Temp
pt: por Nome

# wind_chart_title
source: Wind
pt: Vento

# wind_speed_unit_label
source: Wind speed unit
pt: Unidade para vento

# word_and
source: and
pt: e

# word_end
source: end
pt: término

# word_feels_like
source: feels like
pt: sensação térmica

# word_gust
source: gust
pt: rajada

# word_start
source: start
pt: início

# word_wind
source: wind
pt: vento
